**Titanic - Machine Learning from Disaster**

Overview
The data has been split into two groups:

training set (train.csv)
test set (test.csv)
The training set should be used to build your machine learning models. For the training set, we provide the outcome (also known as the “ground truth”) for each passenger. Your model will be based on “features” like passengers’ gender and class. You can also use feature engineering to create new features.

The test set should be used to see how well your model performs on unseen data. For the test set, we do not provide the ground truth for each passenger. It is your job to predict these outcomes. For each passenger in the test set, use the model you trained to predict whether or not they survived the sinking of the Titanic.

We also include gender_submission.csv, a set of predictions that assume all and only female passengers survive, as an example of what a submission file should look like.

# Data Preprocessing

In [2]:
#import thư viện
import pandas as pd
import numpy as np

In [13]:
train_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")

In [17]:
print('Train set shape:', train_df.shape)
train_df.head()

Train set shape: (891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
print('Test set shape:', test_df.shape)
test_df.head()

Test set shape: (418, 11)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

+ PassengerId: ID duy nhất (không có giá trị dự đoán)

+ Survived: Target variable (0/1)

+ Pclass: Hạng vé (1, 2, 3)

+ Name: Tên hành khách

+ Sex: Giới tính (male/female)

+ Age: Tuổi

+ SibSp: Số anh chị em/vợ chồng đi cùng

+ Parch: Số cha mẹ/con cái đi cùng

+ Ticket: Số vé

+ Fare: Giá vé

+ Cabin: Số cabin

+ Embarked: Cảng lên tàu (C, Q, S)

### Missing Values

In [19]:
train_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
missing_percent = train_df.isna().mean() * 100
missing_summary = pd.DataFrame({
    'Missing Values': train_df.isna().sum(),
    'Percent (%)': missing_percent
})
print(missing_summary)

             Missing Values  Percent (%)
PassengerId               0     0.000000
Survived                  0     0.000000
Pclass                    0     0.000000
Name                      0     0.000000
Sex                       0     0.000000
Age                     177    19.865320
SibSp                     0     0.000000
Parch                     0     0.000000
Ticket                    0     0.000000
Fare                      0     0.000000
Cabin                   687    77.104377
Embarked                  2     0.224467

Xử lý missing values cho Age bằng median theo Sex và Pclass

In [22]:
age_missing_pattern = train_df.groupby(['Sex', 'Pclass'])['Age'].agg(['count', 'mean', 'median'])
print(age_missing_pattern)

               count       mean  median
Sex    Pclass
female 1          85  34.611765    35.0
       2          74  28.722973    28.0
       3         102  21.750000    21.5
male   1         101  41.281386    40.0
       2          99  30.740707    30.0
       3         253  26.507589    25.0

# Exploratory Data Analysis (EDA)

# Model Training

# Hyperparameter Tuning

# Model Evaluation

# Ensemble Methods

# Submission Generation